Revit 2027 API
IFCAggregate.Add Method
 Adds an element to the aggregate.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Add(
	IFCData ifcData
)
Public Sub Add (
	ifcData As IFCData
)
public:
void Add(
	IFCData^ ifcData
)
member Add :
        ifcData : IFCData -> unit
Parameters
ifcData IFCData
 The IFCData element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The aggregate is not valid.
See Also
Reference
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace